#+TITLE: Consensus and SNP calling
#+PROPERTY:  header-args :var DIR=(my/dir)


* Consensus
:PROPERTIES:
:ID:       28b215c2-cf17-448b-9f9f-c402c5ccf355
:END:

1) Creating consensus sequences using medaka (v1.5.0).

  #+HEADER: :var data=../2-samples/data.ser.org:data[,0]
  #+BEGIN_SRC sh :tangle 1-medaka/run.sh
ROOT=$(git rev-parse --show-toplevel)
export DIR ROOT

ml singularity

# clean up singularity medaka command. take the first element as subcommand,
# then remove it from stack. Pass the remaining stack to medaka cmd.
medaka () {
    cmd=medaka_$1
    shift;

    singularity exec -B $ROOT $ROOT/apps/medaka_v1.5.0.sif $cmd $@;
}

bedtools ()  {
    singularity exec -B $ROOT \
        /apps/singularity-3/bedtools/bedtools-2.28.0.sif \
        bedtools $@
}

# function to run consensus. hard-link bottlenaose.mito.fa to bypass race
# condition from running minimap index on the same file in parallel
run () {
    name=$1
    shift;
    mkdir -p $DIR/1-medaka/$name

    [ -e $DIR/1-medaka/$name/bottlenose.mito.fa ] ||
        ln $ROOT/0-ref/bottlenose.mito.fa $DIR/1-medaka/$name/bottlenose.mito.fa

    medaka consensus \
        -i $ROOT/2-samples/0-download/$name.fq \
        -d $DIR/1-medaka/$name/bottlenose.mito.fa \
        -o $DIR/1-medaka/$name &> $DIR/1-medaka/$name/run.log

    # mask bases with low coverage
    bedtools genomecov -bg -ibam $DIR/1-medaka/$name/calls_to_draft.bam |
        awk '$4 >= 15' |
        bedtools merge -i - -d 10 |
        bedtools complement -i - -g $DIR/1-medaka/$name/bottlenose.mito.fa.fai |
        awk '$3 - $2 > 1' |
        bedtools maskfasta -soft -bed - \
            -fi $DIR/1-medaka/$name/consensus.fasta \
            -fo $DIR/1-medaka/$name/consensus.masked.fasta
}

export -f medaka bedtools run

parallel -j 20 --eta run {} ::: "${data[@]}"
  #+END_SRC
2) Combine consensus sequences
  #+HEADER: :var data=../2-samples/data.ser.org:data[,0]
  #+begin_src shell :tangle 1-medaka/1-combine.sh
for name in "${data[@]}"; do
    sed -e "s/>NC_012059.1/>$name/" -e '/>/s/_/ /' \
        $DIR/1-medaka/$name/consensus.masked.fasta |
        fold
done > $DIR/1-medaka/all.consensus.masked.fa
  #+end_src
3) Check species

  Blast consensus sequences against marine dolphins, mark any that map to
  bottlenose

  #+begin_src sh :tangle 1-medaka/2-check.sh
ROOT=$(git rev-parse --show-toplevel)
ml singularity

blastn () {
    singularity exec -B $ROOT \
        /apps/singularity-3/blast/blast-2.9.0.sif blastn "$@"
}

blastn -db $ROOT/0-ref/marine_dolphin.refseq.fasta \
    -query $DIR/1-medaka/all.consensus.masked.fa \
    -outfmt 6 \
    -max_target_seqs 1 |
    awk '$2 != "NC_012059.1"'
  #+end_src

  #+RESULTS:
  | SER18-00667 | NC_012051.1 | 99.378 | 16400 |  87 | 12 | 1 | 16399 | 1 | 16386 | 0.0 | 29706 |
  | SER19-01079 | NC_019588.1 | 98.951 | 16400 | 152 | 16 | 1 | 16395 | 1 | 16385 | 0.0 | 29314 |

  #+NAME: outliers
  | Sample      | Species            |
  |-------------+--------------------|
  | SER18-00667 | Stenella attenuata |
  | SER19-01079 | Feresa attenuata   |
4) Combine bottlenose dolphin consensus sequences
  #+HEADER: :var outliers=outliers[,0]
  #+begin_src sh :tangle 1-medaka/3-remove.sh
ROOT=$(git rev-parse --show-toplevel)
ml singularity

samtools () {
    singularity exec -B $ROOT \
        /apps/singularity-3/samtools/samtools-v1.9-4-deb_cv1.sif \
        samtools "$@" ; }

all=$DIR/1-medaka/all.consensus.masked.fa

samtools faidx $all
grep -v -f <(printf "%s\n" "${outliers[@]}") $all.fai |
    cut -f 1 |
    samtools faidx -r - $all |
     tr 'acgt' 'N' > $DIR/1-medaka/bottlenose.consensus.masked.fa

  #+end_src


* Finalize

#+HEADER: :var all=../2-samples/data.ser.org:data[,0]
#+HEADER: :var plasmic=heteroplasmic-samples[2:5,0]
#+HEADER: :var outliers=outliers[,0]
#+begin_src sh :tangle 2-clair3/2-haploid/merge.sh
ROOT=$(git rev-parse --show-toplevel)
PATH=$ROOT/apps/bcftools-1.15/:$PATH

keep=( $(xargs -n1 <<<"${all[@]}" |
           grep -v -x -f <(xargs -n1 <<<"${outliers[@]} ${plasmic[@]}")) )
echo ${#keep[@]}
#+end_src

#+RESULTS:
: 413

- Consensus sequences
  #+HEADER: :var plasmic=heteroplasmic-samples[2:5,0]
  #+HEADER: :var outliers=outliers[,0]
  #+begin_src sh :tangle final.seqs.sh
ROOT=$(git rev-parse --show-toplevel)
ml singularity 
samtools () 
{ 
    singularity exec -B $ROOT \
        /apps/singularity-3/samtools/samtools-v1.9-4-deb_cv1.sif samtools $@
}


all=$DIR/1-medaka/all.consensus.masked.fa

samtools faidx $all
grep -v -f <(printf "%s\n" "${outliers[@]}" "${plasmic[@]}") $all.fai |
    cut -f 1 |
    samtools faidx -r - $all |
     tr 'acgt' 'N' > $DIR/consensus.masked.fa

  #+end_src

  #+begin_src bash :dir (format "%s" ssh-deploy-root-remote)
grep '>' -c  $DIR/consensus.masked.fa
  #+end_src

  #+RESULTS:
  : 413

- Vcf
  #+begin_src tmux :session dolphin:hawk-1
cp $DIR/2-clair3/2-haploid/filtered.vcf $DIR/
  #+end_src

  #+begin_src bash :dir (format "%s" ssh-deploy-root-remote)
awk '/^#CHROM/ {print NF-9} ' $DIR/filtered.vcf
  #+end_src

  #+RESULTS:
  : 413



  - Called SNPs per amplicon
    #+header: :colnames '("Amplicon" "SNPs")
    #+begin_src bash :dir (format "%s" ssh-deploy-root-remote)
awk '!/^#/ && $7 == "PASS" {_[$1]++}
           END{
                for(i in _){
                      print i, _[i];
                      sum+=_[i]
                 };
                 print "|---";
                 print "Total", sum
                }' OFS="\t" $DIR/2-clair3/2-haploid/merged.vcf
    #+end_src

    #+RESULTS:
    | Amplicon | SNPs |
    |----------+------|
    | P4       |  213 |
    | P10      |  161 |
    | P6       |  220 |
    | P7       |  164 |
    |          |  --- |
    | Total    |  758 |
  - Passed SNPs per amplicon
    #+header: :colnames '("Amplicon" "SNPs")
    #+begin_src bash :dir (format "%s" ssh-deploy-root-remote)
awk '!/^#/ && $7 == "PASS" {_[$1]++}
           END{
                for(i in _){
                      print i, _[i];
                      sum+=_[i]
                 };
                 print "|---";
                 print "Total", sum
                }' OFS="\t" $DIR/filtered.vcf
    #+end_src

    #+RESULTS:
    | Amplicon | SNPs |
    |----------+------|
    | P4       |  210 |
    | P10      |  158 |
    | P6       |  215 |
    | P7       |  160 |
    |          |  --- |
    | Total    |  743 |


 - Total Passed SNPs on mito
    #+begin_src bash :dir (format "%s" ssh-deploy-root-remote)
awk 'BEGIN {
            coord["P4"]  = 2481;
            coord["P6"]  = 9460;
            coord["P7"]  = 15418;
            coord["P10"] = 6906;
           }
    !/^#/ && $7 == "PASS" {
        pos = $2 + coord[$1];
        if(pos > 16388)
            pos = pos - 16388;
        if(_[pos]!=1)
            count++;
        _[pos]=1;
    }
    END { print count } ' $DIR/filtered.vcf
    #+end_src

    #+RESULTS:
    : 481
